In [1]:
!pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.1.0-cp39-cp39-win_amd64.whl (180 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.0

In [19]:
import MySQLdb

In [20]:
# connect 객체
db = MySQLdb.connect(host = 'localhost', port = 3306, user = 'root', password = '1234')

In [21]:
# cursor 객체
cursor = db.cursor()

In [22]:
cursor.execute('show databases;') # 결과의 수

10

In [23]:
cursor.fetchall() # db server애서 출력을 리턴

(('information_schema',),
 ('employees',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('shopdb',),
 ('sqldb',),
 ('sys',),
 ('tabledb',),
 ('world',))

In [28]:
sql = """
use sqldb;
show tables
"""

cursor.execute(sql)
# cursor.fetchall()

0

In [29]:
import pandas as pd

In [30]:
pd.read_sql('show tables;', db)

  Tables_in_sqldb
0          buytbl
1         usertbl

In [31]:
pd.read_sql('select * from usertbl;', db)

  userid name  birthyear addr mobile1  mobile2  height       mdate
0    BBK  바비킴       1973   서울     010  0000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  8888888     174  2014-03-03
2    JKW  조관우       1965   경기     018  9999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  4444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  2222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  3333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  6666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  1111111     182  2008-08-08
8    SSK  성시경       1979   서울    None     None     186  2013-12-12
9    YJS  윤종신       1969   경남    None     None     170  2005-05-05

0

In [33]:
sql = """
use sakila;
"""

cursor.execute(sql)

0

In [35]:
sql = """
show tables;
"""

cursor.execute(sql)
cursor.fetchall()

(('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',))

In [36]:
sql = 'select * from film_list;'

pd.read_sql(sql, db)

,FID,title,description,category,price,length,rating,actors
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"PENELOPE GUINESS, CHRISTIAN GABLE, LUCILLE TRA..."
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"BOB FAWCETT, MINNIE ZELLWEGER, SEAN GUINESS, C..."
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"NICK WAHLBERG, BOB FAWCETT, CAMERON STREEP, RA..."
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"JODIE DEGENERES, SCARLETT DAMON, KENNETH PESCI..."
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"GARY PHOENIX, DUSTIN TAUTOU, MATTHEW LEIGH, MA..."
...,...,...,...,...,...,...,...,...
992,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,Documentary,0.99,183,G,"ED CHASE, JULIA MCQUEEN, JAMES PITT, CHRISTOPH..."
993,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,Music,0.99,179,NC-17,"SANDRA KILMER, VAL BOLGER, SCARLETT BENING, IA..."
994,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,Horror,0.99,105,NC-17,"UMA WOOD, NICK STALLONE, GARY PENN, SALMA NOLT..."
995,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,Children,2.99,101,R,"CARMEN HUNT, MARY TANDY, PENELOPE CRONYN, WHOO..."
996,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,Comedy,4.99,50,NC-17,"IAN TANDY, NICK DEGENERES, LISA MONROE"

In [37]:
# sakila database의 모든 table을 '테이블명.csv' 형식으로 새로운 폴더
# sakila에 csv 파일형식으로 저장하시오

In [38]:
sql = """
show tables;
"""

tables = pd.read_sql(sql, db)

In [41]:
for t in tables.values:
    print(t[0])
    
    sql = 'select * from {}'.format(t[0])
    table_df  pd.read_sql(sql, db)
    table_df.to_csv('./sakila/{}.csv'.format(t[0]))

SyntaxError: invalid syntax (Temp/ipykernel_8824/3783612702.py, line 5)

In [42]:
# world 데이터베이스에서 country 테이블에서 인구수가 10,000,000 이상인 국가명을 출력하시오
# 1. sql을 통해서 값만 출력
# 2. 데이터를 불러와서 pandas로 값을 구하는 방법

In [43]:
# 1.

sql = """
use world;
select * from country where population >= ;
"""

cursor = db.cursor()

cursor.execute(sql)
cursor.fetchall()

()

In [44]:
# 2.

sql = """
use world;
select * from country;
"""

pd.

SyntaxError: invalid syntax (Temp/ipykernel_8824/3476570600.py, line 8)

In [45]:
# 'GovermentForm'에 'Republic'이라는 텍스트가 포함된 국가를 출력
# (country name, city name)형식으로 묶어서 출력